Autodesk.Revit.DB.Structure.AreaReinforcement.SetSolidInView(Autodesk.Revit.DB.View3D,System.Boolean)
Sets this Area Reinforcement to be shown solidly in a 3D view.
view:
The 3D view element
solid:
True if Area Reinforcement is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.AreaReinforcement.IsSolidInView(Autodesk.Revit.DB.View3D)
Checks if this Area Reinforcement is shown solidly in a 3D view.
view:
The 3D view element
Returns:
True if Area Reinforcement is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.AreaReinforcement.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets Area Reinforcement to be shown unobscured in a view.
view:
The view element
unobscured:
True if Area Reinforcement is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.AreaReinforcement.IsUnobscuredInView(Autodesk.Revit.DB.View)
Checks if Area Reinforcement is shown unobscured in a view.
view:
The view element
Returns:
True if Area Reinforcement is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.AreaReinforcement.GetHostId
The element that contains the Area Reinforcement.
Returns:
The element that the Area Reinforcement object belongs to, such as a structural
wall, floor or foundation.

Autodesk.Revit.DB.Structure.AreaReinforcement.GetBoundaryCurveIds
Retrieves the set of curves forming the boundary of the Area Reinforcement.
Remarks:
Each ElementId in the collection is an Id of an Element of type AreaReinforcementCurve. Each element has a Curve property
to retrieve the geometric curve, together with some Parameters allowing the developer to override the clear cover side,
hook type, and hook direction of each layer of bars terminating at the curve.
Returns:
A collection of ElementIds of AreaReinforcementCurve elements.
Since:
2015

Autodesk.Revit.DB.Structure.AreaReinforcement.RemoveAreaReinforcementSystem(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.AreaReinforcement)
Deletes the specified AreaReinforcement, and converts its RebarInSystem
elements to equivalent Rebar elements.
doc:
The document.
system:
An AreaReinforcement element in the document.
Returns:
The ids of the newly created Rebar elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element system was not found in the given document.
-or-
system does not host Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AreaReinforcement.GetRebarInSystemIds
Returns the ids of the RebarInSystem elements owned by the AreaReinforcement
element.
Remarks:
The RebarInSystem elements are only created if
ReinforcementSettings.HostStructuralRebar is set to true. If that setting
is false, this function returns an empty array.
Since:
2013

Autodesk.Revit.DB.Structure.AreaReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new AreaReinforcement object based on a host boundary.
document:
The document.
hostElement:
The element that will host the AreaReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
majorDirection:
A vector to define the major direction of the AreaReinforcement.
areaReinforcementTypeId:
The id of the AreaReinforcementType.
rebarBarTypeId:
The id of the RebarBarType.
rebarHookTypeId:
The id of the RebarHookType.
If this parameter is InvalidElementId, it means to create a rebar with no hooks.
Returns:
The newly created AreaReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElement was not found in the given document.
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
areaReinforcementTypeId should refer to an AreaReinforcementType element.
-or-
rebarBarTypeId should refer to an RebarBarType element.
-or-
rebarHookTypeId should be invalid or refer to an RebarHookType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2015

Autodesk.Revit.DB.Structure.AreaReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new AreaReinforcement object from an array of curves.
This method replaces the NewAreaReinforcement method, which has been deprecated.
document:
The document.
hostElement:
The element that will host the AreaReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
curveArray:
An array of curves that will define the outline of the AreaReinforcement.
majorDirection:
A vector to define the major direction of the AreaReinforcement.
areaReinforcementTypeId:
The id of the AreaReinforcementType.
rebarBarTypeId:
The id of the RebarBarType.
rebarHookTypeId:
The id of the RebarHookType.
If this parameter is InvalidElementId, it means to create a rebar with no hooks.
Returns:
The newly created AreaReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curveArray is empty.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The element hostElement was not found in the given document.
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
Curves in curveArray are not closed and continuous.
-or-
areaReinforcementTypeId should refer to an AreaReinforcementType element.
-or-
rebarBarTypeId should refer to an RebarBarType element.
-or-
rebarHookTypeId should be invalid or refer to an RebarHookType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2015

Autodesk.Revit.DB.Structure.AreaReinforcement.Direction
Retrieve the Major Direction of the Area Reinforcement.

Autodesk.Revit.DB.Structure.AreaReinforcement.AreaReinforcementType
Retrieves the type of the Area Reinforcement.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.AreaReinforcement.AdditionalBottomCoverOffset
Additional offset from the bottom or interior cover reference.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for additionalBottomCoverOffset must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AreaReinforcement.AdditionalTopCoverOffset
Additional offset from the top or exterior cover reference.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for additionalTopCoverOffset must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AreaReinforcement
An object that represents an Area Reinforcement within the Autodesk Revit project.
Remarks:
This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object.
The Area Reinforcement element is available only in the Autodesk Revit Structure product.